function pow(x, y) {

    if (y === 0) return 1; //повертаємо 1, якщо у=0, так як число в 0 ступені дорівнює 1

    if (y < 0) { //перевірка показника ступеню, чи він не від'ємний
        x = 1 / x; //якщо у - від'ємне, то нам потрібно перетворити х на обернене число щоб вирахувати ступінь
        y = -y; //показник ступеню стає позитивним для обчислення дії множення
    }
    
    let result = 1; //ініціалізував спочатку через const і отримував TypeError: Assignment to constant variable, але ж ми далі в циклі перетворюємо цю змінну, тому лише let, що дозволяє змінювати значення після ініціалізації
    
    for (let i = 0; i < y; i++) { // проганяємо цикл 'y' разів, під час кожного прогону result множиться на x, завдяки чому обчислюємо ступінь
        result *= x; //змінюємо result кожну ітерацію
    }
    
    return result; //повертаємо фінальне значення x, піднесене до степеня y
}

console.log(pow(2, 3));
console.log(pow(-2, -1));
console.log(pow(-2, 0));
console.log(pow(0, 0));
console.log(pow(0, 1));

test